app/Controllers/Home.php

SELECT *
FROM `characters`
 LIMIT 20, 10
SELECT COUNT(*) AS `numrows`
FROM `characters`
---
    public function index()
    {
        $perPage = 10; // Número de personajes por página para no abrumar al usuario con tanta informaciòn.
        $data['characters'] = $this->characterModel->paginate($perPage);

INSERT INTO `characters` (`id`, `name`, `description`, `thumbnail_url`, `modified`) VALUES (9042522, 'Maquina de Guerra', 'Superior Iron amn', 'http://i.annihil.us/u/prod/marvel/i/mg/b/40/image_not_available.jpg', '2024-07-31 12:09:15')
---
    public function create()
    {
        $name = $this->request->getPost('name');
        $description = $this->request->getPost('description');

        // Validación de entrada: solo permito ciertos caracteres, en los formularios que eh observado en distintas web's ignoran este detalle importante, puede ser pequeño, pero es un pequeño filtro de evitar pishing. (La mayoria de formularios que eh trabajado, van a correo electronico, y con campos asi eh reducido bastante espam y ataque de pishing)
        if (!preg_match('/^[a-zA-Z0-9\s\(\)\-]+$/', $name)) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Nombre inválido.']);
        }

        if (!preg_match('/^[a-zA-Z0-9\s\.\,\-\!\?]+$/', $description)) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Descripción inválida.']);
        }

        // Datos del nuevo personaje
        $data = [
            'id' => random_int(1000000, 9999999), // ID generado aleatoriamente para no mantenerlo en un AI
            'name' => $name,
            'description' => $description,
            'thumbnail_url' => 'http://i.annihil.us/u/prod/marvel/i/mg/b/40/image_not_available.jpg', // Imagen por defecto
            'modified' => date('Y-m-d H:i:s'), // Fecha de modificación actual
        ];

        $this->characterModel->insert($data);

SELECT *
FROM `characters`
WHERE `characters`.`id` = '1009144'
---
    public function view($id)
    {
        $character = $this->characterModel->find($id);

SELECT *
FROM `characters`
WHERE `characters`.`id` = '9042522'
UPDATE `characters` SET `name` = 'Maquina de Guerra', `description` = 'Superior Iron man', `modified` = '2024-07-31 12:09:25'
WHERE `characters`.`id` IN ('9042522')
---
    public function update()
    {
        $id = $this->request->getPost('id');
        $character = $this->characterModel->find($id);

        if ($character) {
            // Solo actualizar si el personaje existe, ya que hago una consulta si el ID se encuentra.
            //Solo permito modificar dos campos el nombre y descripcion, ya que la Imagen por el momento seria algo mas complejo.
            $data = [
                'name' => $this->request->getPost('name'),
                'description' => $this->request->getPost('description'),
                'modified' => date('Y-m-d H:i:s'), // Fecha de modificación actual
            ];

            // Actualizar el personaje en la base de datos
            $this->characterModel->update($id, $data);

SELECT *
FROM `characters`
WHERE `characters`.`id` = '9042522'
DELETE FROM `characters`
WHERE `id` IN ('9042522')
---
    public function delete($id)
    {
        $character = $this->characterModel->find($id);
        //Se colocaron alertas sencillas solo para notificar al usuario
        if ($character) {
            $this->characterModel->delete($id);

SELECT *
FROM `characters`
WHERE `id` LIKE '%iron%' ESCAPE '!'
OR  `name` LIKE '%iron%' ESCAPE '!'
OR  `description` LIKE '%iron%' ESCAPE '!'
---
    public function search()
    {
        $query = $this->request->getPost('query');

        // Búsqueda en ID, nombre y descripción para ser la busqueda mas exacta
        $characters = $this->characterModel
            ->like('id', $query)
            ->orLike('name', $query)
            ->orLike('description', $query)
            ->findAll();